app/views/messages/index.html.erb

     <% count = 1 %>
     <% current_user.messages.each do |message| %>
---
SELECT "messages".* FROM "messages" WHERE "messages"."user_id" = $1  [["user_id", 2]]

     <p>Message:<%= message.body %></p>
     <p><%= link_to 'Reply', user_path(User.find_by(email:message.from)), class: "btn btn-default" %>
---
SELECT  "users".* FROM "users" WHERE "users"."email" = $1 LIMIT 1  [["email", "daimeon@email.com"]]