app/controllers/users_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", 2]]
---
	def show
		@user = User.friendly.find(params[:id])

INSERT INTO "users" ("username", "email", "password_digest", "slug", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"
---
	def create
		user = User.new(user_params)
		if user.save

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", 1]]
---
	def edit
		@user = User.friendly.find(params[:id])

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", 2]]
UPDATE "users" SET "image_url" = $1, "slug" = $2, "updated_at" = $3 WHERE "users"."id" = $4  [["image_url", "http://img5.ph.126.net/Naj686LZf_5PQg2vi2WCWQ==/6598266035307863615.jpg"], ["slug", "bingbing"], ["updated_at", "2015-09-07 18:51:25.218172"], ["id", 2]]
---
	def update
		user = User.friendly.find(params[:id])
		if user == current_user
			user.update_attributes(user_params)