app/views/cities/show.html.erb

SELECT "users".* FROM "users" WHERE "users"."city_id" = $1  [["city_id", "1"]]
---
       <% count = 1 %>
      <% @city.users.each do |user| %>